### First step is install connector for mysql.

In [1]:
#pip install mysql-connector-python

### Now the connector is installed, import it to use

In [1]:
from mysql.connector import connect

### Lets connect the python to mysql. To do so we need MySQL user name, password, local host

In [19]:
connection=connect(host="localhost", user="root", password="Theuserdied@8")
print("Connection enstablished successfully")

Connection enstablished successfully

### Instantiates and returns a cursor using C Extension

In [20]:
mycursor=connection.cursor()

### Lets see the database names in mysql

In [21]:
mycursor.execute("show databases")

for database in mycursor:
    print(database)

('datatype',)
('employee',)
('hr',)
('information_schema',)
('my_info',)
('mydb',)
('mysql',)
('northwind',)
('online_seller',)
('performance_schema',)
('pizza',)
('sslc_student_markshit',)
('student',)
('sys',)

### Lets connect to one of database

In [6]:
hr_db=connect(host="localhost", user="root", password="Theuserdied@8", database="hr")
print("Connection enstablished successfully")

Connection enstablished successfully

### Fetching all records from one table

In [9]:
mycursor=hr_db.cursor()
mycursor.execute("SELECT * FROM locations")
result=mycursor.fetchall()
for records in result:
    print(records)

(1000, '1297 Via Cola di Rie', '00989', 'Roma', None, 'IT')
(1100, '93091 Calle della Testa', '10934', 'Venice', None, 'IT')
(1200, '2017 Shinjuku-ku', '1689', 'Tokyo', 'Tokyo Prefecture', 'JP')
(1300, '9450 Kamiya-cho', '6823', 'Hiroshima', None, 'JP')
(1400, '2014 Jabberwocky Rd', '26192', 'Southlake', 'Texas', 'US')
(1500, '2011 Interiors Blvd', '99236', 'South San Francisco', 'California', 'US')
(1600, '2007 Zagora St', '50090', 'South Brunswick', 'New Jersey', 'US')
(1700, '2004 Charade Rd', '98199', 'Seattle', 'Washington', 'US')
(1800, '147 Spadina Ave', 'M5V 2L7', 'Toronto', 'Ontario', 'CA')
(1900, '6092 Boxwood St', 'YSW 9T2', 'Whitehorse', 'Yukon', 'CA')
(2000, '40-5-12 Laogianggen', '190518', 'Beijing', None, 'CN')
(2100, '1298 Vileparle (E)', '490231', 'Bombay', 'Maharashtra', 'IN')
(2200, '12-98 Victoria Street', '2901', 'Sydney', 'New South Wales', 'AU')
(2300, '198 Clementi North', '540198', 'Singapore', None, 'SG')
(2400, '8204 Arthur St', None, 'London', None, 'UK')
(2500, 'Magdalen Centre, The Oxford Science Park', 'OX9 9ZB', 'Oxford', 'Oxford', 'UK')
(2600, '9702 Chester Road', '09629850293', 'Stretford', 'Manchester', 'UK')
(2700, 'Schwanthalerstr. 7031', '80925', 'Munich', 'Bavaria', 'DE')
(2800, 'Rua Frei Caneca 1360 ', '01307-002', 'Sao Paulo', 'Sao Paulo', 'BR')
(2900, '20 Rue des Corps-Saints', '1730', 'Geneva', 'Geneve', 'CH')
(3000, 'Murtenstrasse 921', '3095', 'Bern', 'BE', 'CH')
(3100, 'Pieter Breughelstraat 837', '3029SK', 'Utrecht', 'Utrecht', 'NL')
(3200, 'Mariano Escobedo 9991', '11932', 'Mexico City', 'Distrito Federal,', 'MX')

### Fetch selected fields from table

In [12]:
import pandas as pd

In [18]:
mycursor.execute("SELECT location_id, country_id FROM locations")
result=mycursor.fetchall()
record_df=pd.DataFrame({'Location_id':[], 'Country_id':[]})
for records in result:
    record=pd.DataFrame({'Location_id':[records[0]], 'Country_id':[records[1]]})
    record_df=pd.concat((record_df, record), axis=0)
record_df

   Location_id Country_id
0       2200.0         AU
0       2800.0         BR
0       1800.0         CA
0       1900.0         CA
0       2900.0         CH
0       3000.0         CH
0       2000.0         CN
0       2700.0         DE
0       2100.0         IN
0       1000.0         IT
0       1100.0         IT
0       1200.0         JP
0       1300.0         JP
0       3200.0         MX
0       3100.0         NL
0       2300.0         SG
0       2400.0         UK
0       2500.0         UK
0       2600.0         UK
0       1400.0         US
0       1500.0         US
0       1600.0         US
0       1700.0         US